In [1]:
print("Hello, world!")

Hello, world!

# Data Types

In [2]:
# a string is either double quotes or single quotes
test = "hello"

print(test)
type(test)

hello

str

In [3]:
# numeric types come in two forms 

# integer
number = 10
# float 
floaty = 5.4

number + floaty # similar types will behave in sync with each other

15.4

In [4]:
# you can concatenate two strings together 
test + test

'hellohello'

In [5]:
# floor division (round to the nearest integer)
number // floaty

1.0

In [6]:
# modulo returns the remainder (useful for checking if a number is even or odd)
number % floaty

4.6

In [7]:
# you can multiply strings 
"foo" * 10

'foofoofoofoofoofoofoofoofoofoo'

## Python Collections

In [8]:
# lists: ordered collection of the same or different types of data
my_list = [1, "2", 3.0, "hi", "hehe"]
print(my_list)

[1, '2', 3.0, 'hi', 'hehe']

In [9]:
# subset lists
print(my_list[2])

3.0

In [10]:
print(my_list[-2])

hi

In [11]:
# dictionary
my_dict = {"a": "anaconda", "b": "baboon", "c": "cat"}
print("i love my", my_dict["c"], "<3")

i love my cat <3

In [12]:
# run command line in notebook
! ls

LICENSE  README.md  assets  data  hello.ipynb  portal-teachingdb-master

In [13]:
#! unzip -o data/portal-teachingdb-master.zip

Archive:  data/portal-teachingdb-master.zip
replace portal-teachingdb-master/surveys2001.csv? [y]es, [n]o, [A]ll, [N]one, [r]ename: ^C

In [14]:
# import pandas package as an alias
import pandas as pd

In [15]:
surveys = pd.read_csv("portal-teachingdb-master/surveys.csv")

In [20]:
surveys.head()

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
35544,35545,12,31,2002,15,AH,NaN,NaN,NaN
35545,35546,12,31,2002,15,AH,NaN,NaN,NaN
35546,35547,12,31,2002,10,RM,F,15.0,14.0
35547,35548,12,31,2002,7,DO,M,36.0,51.0
35548,35549,12,31,2002,5,NaN,NaN,NaN,NaN

In [21]:
surveys.tail()

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
35544,35545,12,31,2002,15,AH,NaN,NaN,NaN
35545,35546,12,31,2002,15,AH,NaN,NaN,NaN
35546,35547,12,31,2002,10,RM,F,15.0,14.0
35547,35548,12,31,2002,7,DO,M,36.0,51.0
35548,35549,12,31,2002,5,NaN,NaN,NaN,NaN

In [23]:
# get data types for each column
surveys.dtypes

record_id            int64
month                int64
day                  int64
year                 int64
plot_id              int64
species_id          object
sex                 object
hindfoot_length    float64
weight             float64
dtype: object

In [24]:
# get column names
surveys.columns

Index(['record_id', 'month', 'day', 'year', 'plot_id', 'species_id', 'sex',
       'hindfoot_length', 'weight'],
      dtype='object')

In [25]:
surveys.index

RangeIndex(start=0, stop=35549, step=1)

In [26]:
surveys.shape

(35549, 9)

In [27]:
surveys["hindfoot_length"]

0        32.0
1        33.0
2        37.0
3        36.0
4        35.0
         ...
35544     NaN
35545     NaN
35546    15.0
35547    36.0
35548     NaN
Name: hindfoot_length, Length: 35549, dtype: float64

In [32]:
# indexing
surveys[300:310]

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
300,301,10,17,1977,17,DS,F,48.0,NaN
301,302,10,17,1977,19,DM,F,36.0,44.0
302,303,10,17,1977,3,DM,M,36.0,31.0
303,304,10,17,1977,21,DM,M,37.0,40.0
304,305,10,17,1977,14,DM,F,35.0,40.0
305,306,10,17,1977,16,DM,M,33.0,23.0
306,307,10,17,1977,19,DM,M,36.0,42.0
307,308,10,17,1977,4,DS,F,48.0,NaN
308,309,10,17,1977,17,DS,M,49.0,NaN
309,310,10,17,1977,11,DS,NaN,NaN,NaN